### <font color="brown">Pandas - Continued</font>

In [6]:
from pandas import Series
from pandas import DataFrame
import numpy as np

---

#### <font color="brown">Creating DataFrames - Continued</font>

**3. Creating a DataFrame from a 2D NumPy array**

In [2]:
rand2d = np.random.random((3,2))
randdf = DataFrame(rand2d)
randdf

          0         1
0  0.433795  0.035749
1  0.531721  0.998864
2  0.310114  0.220321

**Change index and column names**

In [3]:
randdf.index = ['one', 'two', 'three']
randdf.columns = ['first', 'second']
randdf

          first    second
one    0.433795  0.035749
two    0.531721  0.998864
three  0.310114  0.220321

**Or set them up at creation time**

In [4]:
randdf = DataFrame(rand2d, index=['one', 'two', 'three'],
                   columns = ['first', 'second'])
randdf

          first    second
one    0.433795  0.035749
two    0.531721  0.998864
three  0.310114  0.220321

---

#### <font color="brown">Columns</font>

**Membership**

In [5]:
popdat = {'state': ['Arizona','Arizona','Arizona','Virginia','Virginia'],
          'year': [2005, 2010, 2015, 2010, 2015],
          'pop': [5.9, 6.6, 6.8, 7.9, 8.3]}
popdf = DataFrame(popdat)
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [14]:
'debt' in popdf.columns

False

**Each column is a Series**

**Column can be referenced by using column name as index into dataframe**

In [17]:
print(popdf['state'])
print(popdf['state'].name)
print(popdf['state'].values)
print(popdf['state'].index)

0     Arizona
1     Arizona
2     Arizona
3    Virginia
4    Virginia
Name: state, dtype: object
state
['Arizona' 'Arizona' 'Arizona' 'Virginia' 'Virginia']
RangeIndex(start=0, stop=5, step=1)

**Alternatively, a column can be referenced as an attribute of the dataframe**

In [18]:
popdf.state

0     Arizona
1     Arizona
2     Arizona
3    Virginia
4    Virginia
Name: state, dtype: object

**Can get at a subset of columns with list, similar to rows of ndarray or index of Series**

In [19]:
popdf[['state','pop']]

      state  pop
0   Arizona  5.9
1   Arizona  6.6
2   Arizona  6.8
3  Virginia  7.9
4  Virginia  8.3

**Changing column names**

In [20]:
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [22]:
popdf.columns = ['year','state','pop']
popdf

       year  state  pop
0   Arizona   2005  5.9
1   Arizona   2010  6.6
2   Arizona   2015  6.8
3  Virginia   2010  7.9
4  Virginia   2015  8.3

<font color="red">**Warning: Changing column names assigns new names, does NOT rearrange!**</font>

In [23]:
# restore to original
popdf.columns = ['state','year','pop']
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

---

#### <font color="brown">Indexing and Manipulating rows and columns</font>

**Row indexing by position, using loc**

In [24]:
popdf.loc[1]

state    Arizona
year        2010
pop          6.6
Name: 1, dtype: object

**Row of a DataFrame is a Series**

In [25]:
print(popdf.loc[1].name)
print(popdf.loc[1].values)

1
['Arizona' 2010 6.6]

**Range of rows**

In [26]:
popdf.loc[1:3]

      state  year  pop
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9

**<font color="red">Note above, end value of range of rows is INCLUSIVE!</font>**

**Subset of rows, subset of columns**

In [28]:
popdf.loc[[0,2],['state','pop']]

     state  pop
0  Arizona  5.9
2  Arizona  6.8

**Adding a column**

In [29]:
# assign same value to all rows in the column
popdf['debt'] = 1.5
popdf

      state  year  pop  debt
0   Arizona  2005  5.9   1.5
1   Arizona  2010  6.6   1.5
2   Arizona  2015  6.8   1.5
3  Virginia  2010  7.9   1.5
4  Virginia  2015  8.3   1.5

In [32]:
# Assign different value for each row
popdf['debt'] = np.arange(1,6)
popdf

      state  year  pop  debt
0   Arizona  2005  5.9     1
1   Arizona  2010  6.6     2
2   Arizona  2015  6.8     3
3  Virginia  2010  7.9     4
4  Virginia  2015  8.3     5

In [9]:
popdat2 = {'Arizona': {2005: 5.9, 2010: 6.6, 2015: 6.8},
           'Virginia': {2010: 7.9, 2015: 8.3}}
popdf2 = DataFrame(popdat2)
popdf2

      Arizona  Virginia
2005      5.9       NaN
2010      6.6       7.9
2015      6.8       8.3

In [10]:
# Different value for each row
popdf2['NJ'] = [8.2, 8.4, 8.6]
popdf2

      Arizona  Virginia   NJ
2005      5.9       NaN  8.2
2010      6.6       7.9  8.4
2015      6.8       8.3  8.6

**What if assigned values fewer than number of rows**

In [35]:
debts = Series([1.2, 1.5, 1.7])
popdf['debt'] = debts
popdf

      state  year  pop  debt
0   Arizona  2005  5.9   1.2
1   Arizona  2010  6.6   1.5
2   Arizona  2015  6.8   1.7
3  Virginia  2010  7.9   NaN
4  Virginia  2015  8.3   NaN

**NaNs are used to pad insufficient number of values for column**

**Creating a new column with values as a function of the other columns**

In [12]:
rand2d = np.random.random((3,2))
randdf = DataFrame(rand2d)
randdf

          0         1
0  0.641712  0.984396
1  0.973709  0.157285
2  0.929978  0.925829

In [13]:
randdf.index = ['one', 'two', 'three']
randdf.columns = ['first', 'second']
randdf

          first    second
one    0.641712  0.984396
two    0.973709  0.157285
three  0.929978  0.925829

**In randdf, how many rows have first column value > second column value**

In [14]:
randdf['third'] = randdf['first'] > randdf['second']
randdf

          first    second  third
one    0.641712  0.984396  False
two    0.973709  0.157285   True
three  0.929978  0.925829   True

In [15]:
randdf['third'].sum()

2

**Row (index) membership**

In [16]:
'three' in randdf.index

True

In [18]:
randdf['three']

KeyError: 'three'

**<font color="red">Above syntax of dataframe['name'] can only be used with column names</font>**

**Row indexing by labels, using loc**

In [19]:
randdf.loc['two']

first     0.973709
second    0.157285
third         True
Name: two, dtype: object

In [23]:
randdf.loc['two':'three']

          first    second  third
two    0.973709  0.157285   True
three  0.929978  0.925829   True

In [43]:
randdf.loc[1:2]

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

**<font color="red">Can't use numeric indexes here because dataframe is indexed by string labels**

---

**Adding a row using loc**

In [44]:
popdf2

      Arizona  Virginia   NJ
2005      5.9       NaN  8.2
2010      6.6       7.9  8.4
2015      6.8       8.3  8.6

In [45]:
popdf2.loc[2020] = [7.2, 8.6, 8.9]
popdf2

      Arizona  Virginia   NJ
2005      5.9       NaN  8.2
2010      6.6       7.9  8.4
2015      6.8       8.3  8.6
2020      7.2       8.6  8.9

In [47]:
popdf2.loc[[2010,2020]]

      Arizona  Virginia   NJ
2010      6.6       7.9  8.4
2020      7.2       8.6  8.9

**Deleting a column with del operation**

In [48]:
popdf

      state  year  pop  debt
0   Arizona  2005  5.9   1.2
1   Arizona  2010  6.6   1.5
2   Arizona  2015  6.8   1.7
3  Virginia  2010  7.9   NaN
4  Virginia  2015  8.3   NaN

In [49]:
del popdf['debt']
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [50]:
randdf

          first    second  third
one    0.255513  0.566962  False
two    0.661714  0.694857  False
three  0.317130  0.769572  False

In [51]:
del randdf['second']
randdf

          first  third
one    0.255513  False
two    0.661714  False
three  0.317130  False

---

#### <font color="brown">Indexing a DataFrame with iloc (using integer indices)</font>

In [52]:
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [53]:
popdf.loc[1]

state    Arizona
year        2010
pop          6.6
Name: 1, dtype: object

In [54]:
popdf.loc[1,'year']

2010

**Using iloc**

In [55]:
popdf.iloc[1,0]   # use index for rows and columns

'Arizona'

In [56]:
popdf.iloc[1:4]   # slice rows

      state  year  pop
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9

In [57]:
popdf.iloc[[1,2,3]]  # list of row indexes

      state  year  pop
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9

In [190]:
popdf.iloc[:,'state']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

**<font color="red">With iloc you can only use integer indexes for rows and columns</font>**

In [58]:
popdf.iloc[:,0]

0     Arizona
1     Arizona
2     Arizona
3    Virginia
4    Virginia
Name: state, dtype: object

*same as*

In [59]:
popdf['state']

0     Arizona
1     Arizona
2     Arizona
3    Virginia
4    Virginia
Name: state, dtype: object

In [60]:
popdf2

      Arizona  Virginia   NJ
2005      5.9       NaN  8.2
2010      6.6       7.9  8.4
2015      6.8       8.3  8.6
2020      7.2       8.6  8.9

In [61]:
popdf2.iloc[2:,[0,2]]

      Arizona   NJ
2015      6.8  8.6
2020      7.2  8.9

---

#### <font color="brown">Creating a DataFrame from a CSV file (typical usage)</font>

**Using the Pandas method read_csv**

In [11]:
import pandas as pd
mpgfile = open("auto_mpg_original (2).csv")
mpgs = pd.read_csv(mpgfile)
mpgs

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino
...,...,...,...,...,...,...,...,...,...
401,27.0,4.0,140.0,86.0,2790.0,15.6,82.0,1.0,ford mustang gl
402,44.0,4.0,97.0,52.0,2130.0,24.6,82.0,2.0,vw pickup
403,32.0,4.0,135.0,84.0,2295.0,11.6,82.0,1.0,dodge rampage
404,28.0,4.0,120.0,79.0,2625.0,18.6,82.0,1.0,ford ranger
405,31.0,4.0,119.0,82.0,2720.0,19.4,82.0,1.0,chevy s-10

In [12]:
mpgs.shape

(406, 9)

**Note: NAs are read in as NaN which is basically a missing/null value.**

In [13]:
# first 15 rows
mpgs.head(15)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino
5,15.0,8.0,429.0,198.0,4341.0,10.0,70.0,1.0,ford galaxie 500
6,14.0,8.0,454.0,220.0,4354.0,9.0,70.0,1.0,chevrolet impala
7,14.0,8.0,440.0,215.0,4312.0,8.5,70.0,1.0,plymouth fury iii
8,14.0,8.0,455.0,225.0,4425.0,10.0,70.0,1.0,pontiac catalina
9,15.0,8.0,390.0,190.0,3850.0,8.5,70.0,1.0,amc ambassador dpl
10,NaN,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,NaN,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,NaN,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,NaN,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,NaN,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)

**Metadata - descriptive information - of dataframe**

In [14]:
mpgs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406 entries, 0 to 405
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     406 non-null    float64
 2   displacement  406 non-null    float64
 3   horsepower    400 non-null    float64
 4   weight        406 non-null    float64
 5   acceleration  406 non-null    float64
 6   model year    406 non-null    float64
 7   origin        406 non-null    float64
 8   car name      406 non-null    object
dtypes: float64(8), object(1)
memory usage: 28.7+ KB

**In the info above, note that each column now has an inferred datatype, not object.<br>
Also note the number of non-null values per column For instance, mpg has 8 missing values, and horsepower has 6 missing values.**

##### <font color="brown">Get all rows for which mpg column has a null value</font>

In [66]:
mpgs[mpgs['mpg'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
10,NaN,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,NaN,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,NaN,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,NaN,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,NaN,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)
17,NaN,8.0,302.0,140.0,3353.0,8.0,70.0,1.0,ford mustang boss 302
39,NaN,4.0,97.0,48.0,1978.0,20.0,71.0,2.0,volkswagen super beetle 117
367,NaN,4.0,121.0,110.0,2800.0,15.4,81.0,2.0,saab 900s

##### <font color="brown">Get all rows for which horsepower column has a null value</font>

In [67]:
mpgs[mpgs['horsepower'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
38,25.0,4.0,98.0,NaN,2046.0,19.0,71.0,1.0,ford pinto
133,21.0,6.0,200.0,NaN,2875.0,17.0,74.0,1.0,ford maverick
337,40.9,4.0,85.0,NaN,1835.0,17.3,80.0,2.0,renault lecar deluxe
343,23.6,4.0,140.0,NaN,2905.0,14.3,80.0,1.0,ford mustang cobra
361,34.5,4.0,100.0,NaN,2320.0,15.8,81.0,2.0,renault 18i
382,23.0,4.0,151.0,NaN,3035.0,20.5,82.0,1.0,amc concord dl

##### <font color="brown">Get summary starts for numeric columns</font>
**describe** method

In [68]:
mpgs.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin
count,398.000000,406.000000,406.000000,400.000000,406.000000,406.000000,406.000000,406.000000
mean,23.514573,5.475369,194.779557,105.082500,2979.413793,15.519704,75.921182,1.568966
std,7.815984,1.712160,104.922458,38.768779,847.004328,2.803359,3.748737,0.797479
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,105.000000,75.750000,2226.500000,13.700000,73.000000,1.000000
50%,23.000000,4.000000,151.000000,95.000000,2822.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,302.000000,130.000000,3618.250000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000

---

#### <font color="brown">Numpy ufuncs work with DataFrames</font>

In [15]:
df = DataFrame(np.random.randn(4,3),columns=list("ABC"),index=["One","Two","Three",'Four'])
df

              A         B         C
One    0.250492  0.483977 -0.669162
Two   -1.138525 -1.835689 -0.215251
Three  0.333820 -0.163094  0.515181
Four   1.021952 -1.411191  0.498801

In [16]:
np.abs(df)

              A         B         C
One    0.250492  0.483977  0.669162
Two    1.138525  1.835689  0.215251
Three  0.333820  0.163094  0.515181
Four   1.021952  1.411191  0.498801

In [17]:
df  # is original changed?

              A         B         C
One    0.250492  0.483977 -0.669162
Two   -1.138525 -1.835689 -0.215251
Three  0.333820 -0.163094  0.515181
Four   1.021952 -1.411191  0.498801

**Original is not changed**

**Alternatively can use dataframe method abs(), this won't change original df either**

In [18]:
df.abs()

              A         B         C
One    0.250492  0.483977  0.669162
Two    1.138525  1.835689  0.215251
Three  0.333820  0.163094  0.515181
Four   1.021952  1.411191  0.498801

In [19]:
df

              A         B         C
One    0.250492  0.483977 -0.669162
Two   -1.138525 -1.835689 -0.215251
Three  0.333820 -0.163094  0.515181
Four   1.021952 -1.411191  0.498801

**Assign to effect the change**

In [20]:
dfabs = df.abs()
dfabs

              A         B         C
One    0.250492  0.483977  0.669162
Two    1.138525  1.835689  0.215251
Three  0.333820  0.163094  0.515181
Four   1.021952  1.411191  0.498801

In [22]:
dfabs.mean()

A    0.686197
B    0.973488
C    0.474599
dtype: float64

**<font color="red">Note: default axis is 0, so above gets column means</font>**

In [23]:
dfabs.mean(axis=1)  # row means

One      0.467877
Two      1.063155
Three    0.337365
Four     0.977314
dtype: float64

In [28]:
dfabs.cumsum(axis=1)   # cumulative sums of rows

              A         B         C
One    0.250492  0.734470  1.403632
Two    1.138525  2.974215  3.189465
Three  0.333820  0.496914  1.012095
Four   1.021952  2.433143  2.931943

In [27]:
dfabs.sum()     # sum of each column

A    2.744790
B    3.893951
C    1.898395
dtype: float64

##### **What if there are NaN values?**

In [29]:
dfabs2 = dfabs.copy()
dfabs2

              A         B         C
One    0.250492  0.483977  0.669162
Two    1.138525  1.835689  0.215251
Three  0.333820  0.163094  0.515181
Four   1.021952  1.411191  0.498801

In [30]:
dfabs2.iloc[1,1] = np.nan
dfabs2

              A         B         C
One    0.250492  0.483977  0.669162
Two    1.138525       NaN  0.215251
Three  0.333820  0.163094  0.515181
Four   1.021952  1.411191  0.498801

In [31]:
dfabs2['B'].sum()

2.0582619859002884

**NaNs are skipped when summing**<br>
**But they can be considered if needed, with skipna parameter set to False**

In [32]:
dfabs2.mean(skipna=False)

A    0.686197
B         NaN
C    0.474599
dtype: float64

In [33]:
dfabs

              A         B         C
One    0.250492  0.483977  0.669162
Two    1.138525  1.835689  0.215251
Three  0.333820  0.163094  0.515181
Four   1.021952  1.411191  0.498801

In [34]:
dfabs['C'].argmax()

0

In [35]:
dfabs.loc['Three'].argmax()

2